#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-sssSz2CpwAtKXREw

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_sqs_queue.terraform_queue: Refreshing state... [id=https://sqs.ca-central-1.amazonaws.com/588188670678/notification-queue]
aws_cloudwatch_event_rule.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_cloudwatch_event_rule.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_lambda_function.SQSLambda: Refreshing state... [id=ien-dev-notifylambda]
aws_instance.bastion_instance: Refreshing state... [id=i-0f20bd3db70899c62]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=7285274c-7a30-4d8f-8486-17f02ab95ff6]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_lambda_function.SyncApplicants: Refreshing state... [id=ien-dev-syncdata]
aws_lambda_permission.hmbc_to_ien_applicants: Refreshing state... [id=AllowExecutionFromCloudWatch_EarlyMorning]
aws_lambda_permission.hmbc_to_ien_masters: Refreshing state... [id=AllowExecutionFromCloudWatch_Morning]
aws_cloudwatch_event_target.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants-terraform-20220421203905110400000001]
aws_cloudwatch_event_target.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters-terraform-20220421203905121600000002]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.SQSLambda will be updated in-place
  ~ resource "aws_lambda_function" "SQSLambda" {
        id                             = "ien-dev-notifylambda"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"                 = "cd256b8" -> "e0639b7"
              ~ "BUILD_INFO"               = "cd256b8, Sunghwan Park, IEN-802-refactor-report-9, grafted, HEAD, tag: refs/tags/dev" -> "e0639b7, GitHub, Merge-426e34f49db6d3bc8798d11d97733d43f4d79e4f-into-988352b9b6185f410ebb149b5535742069e52be4, grafted, HEAD, refs/remotes/pull/485/merge"
                # (6 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.SyncApplicants will be updated in-place
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "cd256b8" -> "e0639b7"
              ~ "BUILD_INFO"        = "cd256b8, Sunghwan Park, IEN-802-refactor-report-9, grafted, HEAD, tag: refs/tags/dev" -> "e0639b7, GitHub, Merge-426e34f49db6d3bc8798d11d97733d43f4d79e4f-into-988352b9b6185f410ebb149b5535742069e52be4, grafted, HEAD, refs/remotes/pull/485/merge"
                # (13 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
      + s3_bucket                      = "ien-dev-api"
      + s3_key                         = "api-lambda-s3"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "cd256b8" -> "e0639b7"
              ~ "BUILD_INFO"        = "cd256b8, Sunghwan Park, IEN-802-refactor-report-9, grafted, HEAD, tag: refs/tags/dev" -> "e0639b7, GitHub, Merge-426e34f49db6d3bc8798d11d97733d43f4d79e4f-into-988352b9b6185f410ebb149b5535742069e52be4, grafted, HEAD, refs/remotes/pull/485/merge"
                # (14 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.api will be created
  + resource "aws_s3_bucket" "api" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "ien-dev-api"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket.app will be updated in-place
  ~ resource "aws_s3_bucket" "app" {
        id                          = "ien-dev-app"
        tags                        = {}
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_object.api_lambda will be created
  + resource "aws_s3_bucket_object" "api_lambda" {
      + acl                    = "private"
      + bucket                 = "ien-dev-api"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "api-lambda-s3"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./build/empty_lambda.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.api_lambda will be created
  + resource "aws_s3_bucket_policy" "api_lambda" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 3 to add, 4 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 9 estimated
           $211.33600000000000128/mo +$0.0

```

</details>